---
kind: enumMember
id: F:Autodesk.Revit.DB.FabricationDimensionUnitType.Linear
enum: Autodesk.Revit.DB.FabricationDimensionUnitType
source: html/4e5471e0-b4d5-4b55-afa8-66edda1c31b0.htm
---
# Autodesk.Revit.DB.FabricationDimensionUnitType.Linear

Linear.